[
{
"topic":"greeting",
"keywords":["hi","hello","hey","hii","good morning","good evening"],
"text":"Hello! I am the PBR VITS Institutional Assistant. I can provide detailed academic, departmental, admission, placement, infrastructure, and policy information about PBR Visvodaya Institute of Technology and Science."
},

{
"topic":"college_overview",
"keywords":["what is pbr vits","about pbr vits","college overview"],
"text":"PBR Visvodaya Institute of Technology and Science (PBR VITS) is a private engineering institution established in 1998 in Kavali, Andhra Pradesh. It operates under Visvodaya Educational Society and offers undergraduate and postgraduate programs."
},

{
"topic":"accreditation_details",
"keywords":["naac grade","accreditation","aicte approval","approval number"],
"text":"PBR VITS is affiliated with JNTUA and approved by AICTE. NAAC accreditation grade and approval details should be verified from the official website."
},

{
"topic":"campus_area",
"keywords":["campus area","how many acres"],
"text":"The campus is part of the Visvodaya campus in Kavali. Exact land area in acres should be verified from official institutional records."
},

{
"topic":"course_duration",
"keywords":["duration","how many years","btech duration"],
"text":"B.Tech programs are 4 years (8 semesters). M.Tech, MBA, and MCA programs are generally 2 years."
},

{
"topic":"academic_structure",
"keywords":["regulation","credit system","cbcs"],
"text":"The institution follows JNTUA regulations under a semester-based system, generally aligned with CBCS (Choice Based Credit System) structure."
},

{
"topic":"branch_intake",
"keywords":["seat intake","branch intake","cse seats","ece seats"],
"text":"Branch-wise intake capacity varies each academic year. Exact seat distribution for CSE, ECE, EEE, Mechanical, Civil, AI & ML, and IoT should be verified from official admission notifications."
},

{
"topic":"cse_branch",
"keywords":["cse","computer science"],
"text":"CSE focuses on programming, AI, ML, data science, cybersecurity, cloud computing, and full stack development with modern computer labs."
},

{
"topic":"ece_branch",
"keywords":["ece","electronics"],
"text":"ECE focuses on communication systems, VLSI, embedded systems, digital electronics, signal processing, and hardware labs."
},

{
"topic":"eee_branch",
"keywords":["eee","electrical engineering"],
"text":"EEE focuses on power systems, electrical machines, renewable energy systems, and control engineering."
},

{
"topic":"mechanical_branch",
"keywords":["mechanical"],
"text":"Mechanical Engineering includes thermodynamics, manufacturing, CAD/CAM, robotics fundamentals, and workshop practice."
},

{
"topic":"civil_branch",
"keywords":["civil"],
"text":"Civil Engineering includes structural engineering, geotechnical engineering, environmental engineering, and construction management."
},

{
"topic":"ai_ml_branch",
"keywords":["ai","machine learning"],
"text":"AI & ML specialization focuses on deep learning, neural networks, computer vision, and intelligent systems."
},

{
"topic":"iot_branch",
"keywords":["iot"],
"text":"IoT specialization focuses on embedded systems, smart devices, sensor networks, and automation."
},

{
"topic":"faculty_details",
"keywords":["faculty","hod","professors"],
"text":"Each department is headed by a Head of Department (HOD) and supported by qualified faculty members including Professors, Associate Professors, and Assistant Professors."
},

{
"topic":"laboratories",
"keywords":["labs","laboratories"],
"text":"Departments have dedicated laboratories such as Programming Labs, Digital Electronics Labs, Communication Labs, Electrical Machines Labs, CAD Labs, Workshop Labs, and Project Labs."
},

{
"topic":"library",
"keywords":["library","books","journals"],
"text":"The central library contains textbooks, reference books, journals, and digital learning resources. Exact book count should be verified from official records."
},

{
"topic":"placements",
"keywords":["placement","placement percentage","highest package","average package"],
"text":"The Placement Cell conducts campus recruitment training and placement drives. Recruiters include TCS, Wipro, Infosys, Tech Mahindra, and others. Annual placement percentage and package statistics vary each year and are published officially."
},

{
"topic":"internships",
"keywords":["internship","industrial visit"],
"text":"Students are encouraged to undertake internships, industrial visits, and project-based industry interaction."
},

{
"topic":"committees",
"keywords":["iqac","anti ragging","grievance","women cell","icc","sc st cell"],
"text":"The institution has statutory bodies including Anti-Ragging Committee, Internal Complaints Committee (ICC), Grievance Redressal Cell, SC/ST Cell, Women Protection Cell, and Internal Quality Assurance Cell (IQAC)."
},

{
"topic":"examination_system",
"keywords":["exam pattern","internal marks","supplementary"],
"text":"The examination system includes internal assessments and external semester-end exams under JNTUA regulations. Supplementary exams are conducted for backlog students."
},

{
"topic":"hostel_details",
"keywords":["hostel","mess","accommodation"],
"text":"Separate hostels for boys and girls are available with mess facilities and essential amenities. Hostel capacity details should be verified from official sources."
},

{
"topic":"transport",
"keywords":["transport","bus facility"],
"text":"Transport services are provided for students from nearby towns and villages."
},

{
"topic":"campus_facilities",
"keywords":["canteen","medical","sports","gym"],
"text":"Campus facilities may include sports grounds, seminar halls, cafeteria, and basic amenities. Specific facility details should be verified from the official website."
},

{
"topic":"alumni",
"keywords":["alumni"],
"text":"Alumni of PBR VITS are working in engineering, IT, and various professional sectors across India and abroad."
},

{
"topic":"student_portal",
"keywords":["student portal","erp","results link"],
"text":"Students can access academic information, results, and notifications through official institutional or university portals."
},

{
"topic":"contact_details",
"keywords":["contact number","phone number","email"],
"text":"For official contact information including phone numbers and email addresses, please refer to the official website https://pbrvits.ac.in/."
},

{
"topic":"social_media",
"keywords":["instagram","facebook","linkedin","youtube"],
"text":"Official social media links can be found on the footer section of the official website https://pbrvits.ac.in/."
},

{
"topic":"official_website",
"keywords":["official website","college website"],
"text":"The official website of PBR VITS is https://pbrvits.ac.in/ where admissions, placements, academic calendar, and notifications are published."
}
]"topic":"placements",
"keywords":["placement","placements","companies","salary"],
"text":"The Placement Cell conducts campus recruitment training, aptitude sessions, mock interviews, and placement drives. Recruiters include TCS, Wipro, Infosys, Tech Mahindra, and other IT companies."
},

{
"topic":"training",
"keywords":["crt","training"],
"text":"Campus Recruitment Training (CRT) includes aptitude preparation, technical skill enhancement, communication skills, and interview preparation."
},

{
"topic":"facilities",
"keywords":["facilities","infrastructure","labs","library"],
"text":"The campus provides academic blocks, computer labs, electronics labs, mechanical workshops, library, Wi-Fi connectivity, seminar halls, and digital resources."
},

{
"topic":"hostel",
"keywords":["hostel"],
"text":"Separate hostel facilities are available for boys and girls with essential amenities."
},

{
"topic":"transport",
"keywords":["transport","bus facility"],
"text":"Transport services are available for students from nearby towns and villages."
},

{
"topic":"sports",
"keywords":["sports","events","fest"],
"text":"Students participate in sports, cultural programs, technical fests, seminars, and extracurricular activities."
},

{
"topic":"scholarship",
"keywords":["scholarship","fee reimbursement"],
"text":"Eligible students may apply for government scholarships and fee reimbursement schemes as per Andhra Pradesh policies."
},

{
"topic":"anti_ragging",
"keywords":["ragging"],
"text":"The college follows strict anti-ragging policies as per AICTE regulations."
},

{
"topic":"exams",
"keywords":["exam","results","academic calendar"],
"text":"Semester exams, academic schedules, and results are published on the official website."
},

{
"topic":"social_media",
"keywords":["instagram","facebook","linkedin","youtube","social media"],
"text":"For official social media pages and updates, visit the official website https://pbrvits.ac.in/ and check the footer section."
},

{
"topic":"website",
"keywords":["official website","college website"],
"text":"The official website of PBR VITS is https://pbrvits.ac.in/ where you can find notifications, admissions, placements, and academic information."
}
]
