[
{
"topic":"greeting",
"keywords":["hi","hello","hey","hii","good morning","good evening"],
"text":"Hello! I am the PBR VITS Assistant. How can I help you today regarding PBR Visvodaya Institute of Technology and Science?"
},

{
"topic":"college_overview",
"keywords":[
"pbr vits",
"what is pbr vits",
"about pbr vits",
"tell me about pbr vits",
"college information",
"college details"
],
"text":"PBR Visvodaya Institute of Technology and Science (PBR VITS) is a private engineering and management institution established in 1998 in Kavali, Andhra Pradesh. It operates under Visvodaya Educational Society and offers undergraduate and postgraduate programs."
},

{
"topic":"location",
"keywords":["where is pbr vits","location","address","college address"],
"text":"PBR VITS is located at Visvodaya Campus, Udayagiri Road, Kavali, Nellore District, Andhra Pradesh, India."
},

{
"topic":"google_map",
"keywords":["google map","map","directions","location map","navigate","route to pbr vits"],
"text":"You can view the exact location of PBR VITS on Google Maps here: https://www.google.com/maps/search/?api=1&query=PBR+Visvodaya+Institute+of+Technology+and+Science+Kavali"
},

{
"topic":"affiliation",
"keywords":["affiliated","university","aicte","naac","accreditation"],
"text":"PBR VITS is affiliated with Jawaharlal Nehru Technological University Anantapur (JNTUA). It is approved by AICTE and accredited by NAAC."
},

{
"topic":"course_duration",
"keywords":["duration","how many years","btech duration","mba duration","mtech duration"],
"text":"B.Tech programs are 4 years (8 semesters). M.Tech, MBA, and MCA programs are generally 2 years."
},

{
"topic":"academic_structure",
"keywords":["semester system","regulation","cbcs","credit system"],
"text":"The institution follows JNTUA regulations under a semester-based academic system, typically aligned with CBCS (Choice Based Credit System)."
},

{
"topic":"courses",
"keywords":["course","courses","branches","departments","programs offered"],
"text":"PBR VITS offers B.Tech programs in CSE, ECE, EEE, Mechanical Engineering, Civil Engineering, AI & ML, and IoT. It also offers MBA, MCA, and M.Tech programs."
},

{
"topic":"cse_branch",
"keywords":["cse","computer science","cse department","cse branch"],
"text":"The Computer Science and Engineering (CSE) department focuses on programming, AI, machine learning, data science, cloud computing, and software development with modern computer labs."
},

{
"topic":"ece_branch",
"keywords":["ece","electronics","electronics and communication","ece department"],
"text":"The Electronics and Communication Engineering (ECE) department focuses on communication systems, VLSI design, embedded systems, digital electronics, and signal processing."
},

{
"topic":"eee_branch",
"keywords":["eee","electrical engineering","eee department"],
"text":"The Electrical and Electronics Engineering (EEE) department focuses on power systems, electrical machines, renewable energy systems, and control engineering."
},

{
"topic":"mechanical_branch",
"keywords":["mechanical","mechanical engineering","mechanical department"],
"text":"The Mechanical Engineering department includes thermodynamics, manufacturing processes, machine design, and workshop practice."
},

{
"topic":"civil_branch",
"keywords":["civil","civil engineering","civil department"],
"text":"The Civil Engineering department focuses on structural engineering, environmental engineering, construction technology, and surveying."
},

{
"topic":"ai_ml_branch",
"keywords":["ai","machine learning","artificial intelligence"],
"text":"The AI & ML specialization focuses on deep learning, neural networks, data analytics, and intelligent system development."
},

{
"topic":"iot_branch",
"keywords":["iot","internet of things"],
"text":"The IoT specialization focuses on embedded systems, smart devices, sensors, and automation technologies."
},

{
"topic":"admissions",
"keywords":["admission","how to join","eligibility","entrance exam","eapcet","pgcet","icet"],
"text":"B.Tech admissions are through AP EAPCET counseling. M.Tech admissions require PGECET or GATE. MBA and MCA admissions are based on AP ICET."
},

{
"topic":"fees",
"keywords":["fees","fee structure","tuition","college fees"],
"text":"The approximate total B.Tech tuition fee ranges between ₹1.6–₹1.8 lakhs. PG program fees vary depending on specialization."
},

{
"topic":"placements",
"keywords":["placement","placements","companies","salary","placement details"],
"text":"The Placement Cell conducts campus recruitment training, aptitude sessions, mock interviews, and placement drives. Recruiters include TCS, Wipro, Infosys, Tech Mahindra, and other companies."
},

{
"topic":"facilities",
"keywords":["facilities","infrastructure","labs","library","campus facilities"],
"text":"The campus includes academic blocks, modern laboratories, computer centers, library, seminar halls, hostels, and transport facilities."
},

{
"topic":"laboratories",
"keywords":["laboratories","labs details"],
"text":"Departments have subject-specific laboratories including Programming Labs, Digital Electronics Labs, Communication Labs, Electrical Machines Labs, CAD Labs, and Workshop Labs."
},

{
"topic":"library",
"keywords":["library","books","journals","digital library"],
"text":"The central library provides textbooks, reference books, journals, and digital learning resources."
},

{
"topic":"hostel",
"keywords":["hostel","accommodation","mess"],
"text":"Separate hostel facilities are available for boys and girls with essential amenities and mess facilities."
},

{
"topic":"transport",
"keywords":["transport","bus facility"],
"text":"Transport services are available for students from nearby towns and villages."
},

{
"topic":"scholarships",
"keywords":["scholarship","fee reimbursement"],
"text":"Eligible students may receive government scholarships and fee reimbursement schemes as per Andhra Pradesh regulations."
},

{
"topic":"exams",
"keywords":["exam","results","supplementary","internal marks","external exam"],
"text":"Semester exams, internal assessments, supplementary exams, and results are conducted as per JNTUA regulations and published on the official website."
},

{
"topic":"committees",
"keywords":["iqac","anti ragging","grievance","women cell","icc","sc st cell"],
"text":"The institution has statutory committees including Anti-Ragging Committee, Internal Complaints Committee (ICC), Grievance Redressal Cell, SC/ST Cell, Women Protection Cell, and Internal Quality Assurance Cell (IQAC)."
},

{
"topic":"student_portal",
"keywords":["student portal","erp","online portal"],
"text":"Students can access academic information, attendance, and results through institutional or university online portals."
},

{
"topic":"contact",
"keywords":["contact","phone number","email","contact details"],
"text":"For official contact information, please visit the official website https://pbrvits.ac.in/."
},

{
"topic":"social_media",
"keywords":["instagram","facebook","linkedin","youtube","social media"],
"text":"Official social media links are available in the footer section of the official website https://pbrvits.ac.in/."
},

{
"topic":"official_website",
"keywords":["official website","college website"],
"text":"The official website of PBR VITS is https://pbrvits.ac.in/ where admissions, placements, results, and academic notifications are published."
}
  ]
