[
{
"topic":"greeting",
"keywords":["hi","hello","hey","hii","good morning","good evening"],
"text":"Hello! I am the PBR VITS Chatbot. I can provide detailed information about departments like CSE and ECE, admissions, placements, facilities, and everything related to PBR Visvodaya Institute of Technology and Science."
},

{
"topic":"about",
"keywords":["about","what is pbr vits","college details"],
"text":"PBR Visvodaya Institute of Technology and Science (PBR VITS) is a private engineering institution established in 1998 in Kavali, Andhra Pradesh. It operates under Visvodaya Educational Society and offers undergraduate and postgraduate programs in engineering and management."
},

{
"topic":"history",
"keywords":["history","established year","founding year"],
"text":"PBR VITS was established in 1998. The Visvodaya Educational Society behind the institution has been contributing to education since 1952."
},

{
"topic":"vision",
"keywords":["vision","mission"],
"text":"The vision of PBR VITS is to provide quality technical education and develop competent engineers with innovation and ethical values. Its mission focuses on academic excellence, research, industry interaction, and holistic student development."
},

{
"topic":"location",
"keywords":["location","where is","address"],
"text":"PBR VITS is located at Visvodaya Campus, Udayagiri Road, Kavali, Nellore District, Andhra Pradesh, India."
},

{
"topic":"affiliation",
"keywords":["affiliated","university","aicte","naac","approved"],
"text":"The college is affiliated with Jawaharlal Nehru Technological University Anantapur (JNTUA). It is approved by AICTE and accredited by NAAC."
},

{
"topic":"cse",
"keywords":["cse","computer science"],
"text":"The Computer Science and Engineering (CSE) department focuses on programming, software development, artificial intelligence, machine learning, data science, web technologies, and emerging computing technologies. It includes computer labs, project development facilities, and placement-oriented training."
},

{
"topic":"ece",
"keywords":["ece","electronics and communication"],
"text":"The Electronics and Communication Engineering (ECE) department focuses on communication systems, embedded systems, VLSI design, signal processing, and electronics hardware labs. Students gain practical exposure through projects, workshops, and lab experiments."
},

{
"topic":"eee",
"keywords":["eee","electrical engineering"],
"text":"The Electrical and Electronics Engineering (EEE) department covers power systems, electrical machines, control systems, and renewable energy systems with laboratory training and industrial exposure."
},

{
"topic":"mechanical",
"keywords":["mechanical engineering","mechanical department"],
"text":"The Mechanical Engineering department covers subjects like thermodynamics, manufacturing, design engineering, and machine tools with practical lab sessions and workshop facilities."
},

{
"topic":"civil",
"keywords":["civil engineering","civil department"],
"text":"The Civil Engineering department focuses on structural engineering, construction technology, environmental engineering, and surveying with lab and field exposure."
},

{
"topic":"ai_ml",
"keywords":["ai","machine learning","artificial intelligence"],
"text":"The AI & ML specialization focuses on artificial intelligence, deep learning, neural networks, data analytics, and intelligent systems."
},

{
"topic":"iot",
"keywords":["iot","internet of things"],
"text":"The Internet of Things (IoT) specialization focuses on connected systems, embedded devices, smart applications, and sensor-based technologies."
},

{
"topic":"mba",
"keywords":["mba","management course"],
"text":"The MBA program focuses on business administration, marketing, finance, human resource management, and entrepreneurship development."
},

{
"topic":"mca",
"keywords":["mca"],
"text":"The MCA program focuses on computer applications, software development, database systems, and IT management."
},

{
"topic":"mtech",
"keywords":["mtech","m.tech"],
"text":"M.Tech programs are offered in selected engineering specializations and focus on advanced technical knowledge and research."
},

{
"topic":"admissions",
"keywords":["admission","eligibility","entrance exam"],
"text":"B.Tech admissions are through AP EAPCET counseling. M.Tech admissions require PGECET or GATE qualification. MBA and MCA admissions are based on AP ICET scores."
},

{
"topic":"fees",
"keywords":["fees","fee structure"],
"text":"Approximate total B.Tech tuition fee ranges from ₹1.6–₹1.8 lakhs. PG course fees vary by program and academic year."
},

{
"topic":"placements",
"keywords":["placement","placements","companies","salary"],
"text":"The Placement Cell conducts campus recruitment training, aptitude sessions, mock interviews, and placement drives. Recruiters include TCS, Wipro, Infosys, Tech Mahindra, and other IT companies."
},

{
"topic":"training",
"keywords":["crt","training"],
"text":"Campus Recruitment Training (CRT) includes aptitude preparation, technical skill enhancement, communication skills, and interview preparation."
},

{
"topic":"facilities",
"keywords":["facilities","infrastructure","labs","library"],
"text":"The campus provides academic blocks, computer labs, electronics labs, mechanical workshops, library, Wi-Fi connectivity, seminar halls, and digital resources."
},

{
"topic":"hostel",
"keywords":["hostel"],
"text":"Separate hostel facilities are available for boys and girls with essential amenities."
},

{
"topic":"transport",
"keywords":["transport","bus facility"],
"text":"Transport services are available for students from nearby towns and villages."
},

{
"topic":"sports",
"keywords":["sports","events","fest"],
"text":"Students participate in sports, cultural programs, technical fests, seminars, and extracurricular activities."
},

{
"topic":"scholarship",
"keywords":["scholarship","fee reimbursement"],
"text":"Eligible students may apply for government scholarships and fee reimbursement schemes as per Andhra Pradesh policies."
},

{
"topic":"anti_ragging",
"keywords":["ragging"],
"text":"The college follows strict anti-ragging policies as per AICTE regulations."
},

{
"topic":"exams",
"keywords":["exam","results","academic calendar"],
"text":"Semester exams, academic schedules, and results are published on the official website."
},

{
"topic":"social_media",
"keywords":["instagram","facebook","linkedin","youtube","social media"],
"text":"For official social media pages and updates, visit the official website https://pbrvits.ac.in/ and check the footer section."
},

{
"topic":"website",
"keywords":["official website","college website"],
"text":"The official website of PBR VITS is https://pbrvits.ac.in/ where you can find notifications, admissions, placements, and academic information."
}
]
